const parseLyrics = require('../tools/parseLyric');


const sourceLyric = "[00:00.00] 作词 : 黄家驹\n[00:01.00] 作曲 : 黄家驹\n[00:02.00] 编曲 : Lupo Groinig\n[00:03.00] 制作人 : 梁翘柏\n[00:12.94]细雨带风湿透黄昏的街道\n[00:19.34]抹去雨水双眼无故地仰望\n[00:24.89]望向孤单的晚灯\n[00:28.33]是那伤感的记忆\n[00:35.15]再次泛起心里无数的思念\n[00:41.57]以往片刻欢笑仍挂在脸上\n[00:46.89]愿你此刻可会知\n[00:50.42]是我衷心的说声\n[00:55.67]喜欢你 那双眼动人\n[01:01.93]笑声更迷人\n[01:05.02]愿再可 轻抚你\n[01:11.50]那可爱面容\n[01:14.55]挽手说梦话\n[01:17.77]像昨天 你共我\n[01:28.82]满带理想的我曾经多冲动\n[01:35.09]抱怨与她相爱难有自由\n[01:40.71]愿你此刻可会知\n[01:44.14]是我衷心的说声\n[01:49.36]喜欢你 那双眼动人\n[01:55.54]笑声更迷人\n[01:58.78]愿再可 轻抚你\n[02:05.13]那可爱面容\n[02:08.17]挽手说梦话\n[02:11.47]像昨天 你共我\n[02:29.71]每晚夜里自我独行\n[02:33.52]随处荡 多冰冷\n[02:42.22]以往为了自我挣扎\n[02:46.11]从不知 她的痛苦\n[02:58.78]喜欢你 那双眼动人\n[03:05.02]笑声更迷人\n[03:08.17]愿再可 轻抚你\n[03:14.66]那可爱面容\n[03:17.90]挽手说梦话\n[03:20.91]像昨天 你共我\n[03:28.17]哦哦哦 哦哦\n[03:31.23]哦哦哦 哦哦\n[03:34.39]哦哦哦 哦哦\n[03:37.55]哦哦哦 哦哦\n[03:40.76]哦哦哦 哦哦\n[03:43.84]哦哦哦 哦哦\n[03:47.03]哦哦哦 哦哦\n[03:50.19]哦哦哦 哦哦\n[03:53.38]哦哦哦 哦哦\n[03:56.46]哦哦哦 哦哦\n[03:59.67]哦哦哦 哦哦\n"

const parsedLyric = parseLyrics(sourceLyric);

module.exports = parsedLyric;


